## Plans :heavy_multiplication_x:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/06cb463e-9ac2-441d-b774-ba1ba5459ffb).


Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: run
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/install_pkgs.sh`
```

```
**Step**: run
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/setup_akash.sh`
```

```
**Step**: env
**Success**: :thumbsup:
**Command**: `/github/workspace/scripts/akash_providers.sh`
```
["akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"]

```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>


## Dir: layers/core | :heavy_multiplication_x:
**Dir**: layers/core
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:
```

```
**Step**: env
**Success**: :thumbsup:
**Command**: `bash -c set -e
set -u
source "$@" > /tmp/tmpa34d0s_l 2>&1
env -0 bash /github/workspace/scripts/s3_backend.sh`
```

```
**Step**: init
**Success**: :thumbsup:
**Command**: `tofu init -backend-config=backend.hcl -migrate-state`
```
#=#=#                                                                         ##############################################################            86.8%######################################################################## 100.0%

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for etcd...
- etcd in .terraform/modules/etcd/modules/coordination/etcd
- etcd.etcd_deployment in .terraform/modules/etcd/modules/compute/akash
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for mysql...
- mysql in .terraform/modules/mysql/modules/db/mysql
- mysql.mysql_deployment in .terraform/modules/mysql/modules/compute/akash
Downloading git::https://github.com/LumeWeb/terraform-modules.git?ref=develop for renterd...
- renterd in .terraform/modules/renterd/modules/compute/renterd
- renterd.renterd_deployment in .terraform/modules/renterd/modules/compute/akash

Initializing provider plugins...
- Finding registry.terraform.io/***/akash versions matching "0.1.1"...
- Finding latest version of hashicorp/null...
- Finding cloudflare/cloudflare versions matching "5.0.0-alpha1"...
- Installing registry.terraform.io/***/akash v0.1.1...
- Installed registry.terraform.io/***/akash v0.1.1 (signed, key ID 3092C291174CD877)
- Installing hashicorp/null v3.2.3...
- Installed hashicorp/null v3.2.3 (signed, key ID 0C0AF313E5FD9F80)
- Installing cloudflare/cloudflare v5.0.0-alpha1...
- Installed cloudflare/cloudflare v5.0.0-alpha1 (signed, key ID C76001609EE3B136)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmp8qpy1390/plan`
```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + etcd_endpoint    = (known after apply)
  + mysql_endpoint   = (known after apply)
  + renterd_endpoint = "renterd.test-node.testing.pinner.xyz"
╷
│ Warning: Check block assertion failed
│ 
│   on .terraform/modules/renterd/modules/compute/renterd/validations.tf line 56, in check "network_base_url":
│   56:     condition = can(regex("^https?://", var.network.base_url))
│     ├────────────────
│     │ var.network is object with 5 attributes
│ 
│ Network base_url must start with http:// or https://
╵
╷
│ Error: Invalid value for variable
│ 
│   on main.tf line 76, in module "renterd":
│   76:   database = {
│   77:     type = "mysql"
│   78:     mysql_uri = "mysql://${module.mysql.provider_host}:${module.mysql.port}"
│   79:     mysql_password = var.mysql_root_password
│   80:   }
│     ├────────────────
│     │ var.database.mysql_database is null
│     │ var.database.mysql_metrics_database is null
│     │ var.database.mysql_uri is a string
│     │ var.database.mysql_user is null
│     │ var.database.type is "mysql"
│ 
│ When using MySQL, all MySQL configuration parameters must be provided
│ 
│ This was checked by the validation rule at
│ .terraform/modules/renterd/modules/compute/renterd/inputs.tf:51,3-13.
╵
╷
│ Error: Error in function call
│ 
│   on .terraform/modules/renterd/modules/compute/renterd/locals.tf line 71, in locals:
│   71:   bus_remote_addr = coalesce(
│   72:     try("${local.proto}://${var.worker_config.bus_remote_addr}/api/bus", ""),
│   73:     ""
│   74:   )
│     ├────────────────
│     │ while calling coalesce(vals...)
│     │ local.proto is "http"
│     │ var.worker_config.bus_remote_addr is null
│ 
│ Call to function "coalesce" failed: no non-null, non-empty-string
│ arguments.
╵
╷
│ Error: Error in function call
│ 
│   on .terraform/modules/renterd/modules/compute/renterd/locals.tf line 76, in locals:
│   76:   autopilot_bus_remote_addr = coalesce(
│   77:     try("${local.proto}://${var.autopilot_config.bus_remote_addr}/api/bus", ""),
│   78:     ""
│   79:   )
│     ├────────────────
│     │ while calling coalesce(vals...)
│     │ local.proto is "http"
│     │ var.autopilot_config.bus_remote_addr is null
│ 
│ Call to function "coalesce" failed: no non-null, non-empty-string
│ arguments.
╵

```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
